import { rounded } from '../geometry'

// 内存条：长条 PCB + 三颗颗粒 + 底部金手指（中间留一个防呆缺口）；金手指间距 2，横竖线都落在 .5 上
export default ({ radius }) => [
  rounded([[2.5, 6.5], [21.5, 6.5], [21.5, 15.5], [2.5, 15.5]], Math.min(radius, 1)),
  rounded([[5.5, 8.5], [8.5, 8.5], [8.5, 13.5], [5.5, 13.5]], Math.min(radius, 0.5)),
  rounded([[10.5, 8.5], [13.5, 8.5], [13.5, 13.5], [10.5, 13.5]], Math.min(radius, 0.5)),
  rounded([[15.5, 8.5], [18.5, 8.5], [18.5, 13.5], [15.5, 13.5]], Math.min(radius, 0.5)),
  'M5.5 15.5V18',
  'M7.5 15.5V18',
  'M9.5 15.5V18',
  'M14.5 15.5V18',
  'M16.5 15.5V18',
  'M18.5 15.5V18',
]
